<template>
  <div>
    <el-form size="small" :model="formData" label-width="auto" label-suffix=":">
      <el-form-item label="正股">
        <TabSelectMult :options="stockOptions" v-model="formData.正股List" />
      </el-form-item>
      <!-- <el-form-item label="到期日">
        <TabSelectMult :options="deadline_list.map((el) => ({ label: el, value: el }))" v-model="formData.到期日List" />
      </el-form-item> -->
      <el-form-item label="沽购">
        <TabSelectMult :options="['沽', '购'].map((el) => ({ label: el, value: el }))" v-model="formData.沽购List" />
      </el-form-item>
    </el-form>
  </div>
  <OrderTable :formData="formData" :orderList="props.orderList" dayStr="2026-06-05" />
  <!-- <OrderTable v-for="item in LIST" :formData="formData" :orderList="item.data" :dayStr="item.day" /> -->
</template>
<script setup>
import { formatNumberToWan, formatDecimal } from "~/utils/utils";
import { OPTIONS_MAP, deadline_list } from "~/data";
import dayjs from "dayjs";
import _ from "lodash";
const props = defineProps(["orderList"]);
const stockOptions = OPTIONS_MAP.map((el) => ({
  label: el.name,
  value: el.code,
}));
const formData = reactive({
  正股List: [...OPTIONS_MAP.map((el) => el.code)],
  到期日List: [...deadline_list],
  沽购List: ["沽", "购"],
});

const LIST = [
  {
    day: "2026-06-05",
    data: [
      { 沽购: "购", 正股ShowName: "50ETF🧊", 到期月: 7, 行权价: 3000, 正股代码: "510050", 期权名称: "50ETF购7月3000", list: [{ 期权名称: "50ETF购7月3000", 成交时间: "14:30:31", 持仓变化: 1, 成交价格: 0.047, 正股代码: "510050" }], 成交金额sum: 0.047, 持仓变化sum: 1 },
      { 沽购: "购", 正股ShowName: "50ETF🧊", 到期月: 7, 行权价: 3100, 正股代码: "510050", 期权名称: "50ETF购7月3100", list: [{ 期权名称: "50ETF购7月3100", 成交时间: "14:43:27", 持仓变化: 1, 成交价格: 0.02, 正股代码: "510050" }], 成交金额sum: 0.02, 持仓变化sum: 1 },
      { 沽购: "沽", 正股ShowName: "300ETF🍆", 到期月: 6, 行权价: 4500, 正股代码: "510300", 期权名称: "300ETF沽6月4500", list: [{ 期权名称: "300ETF沽6月4500", 成交时间: "14:51:41", 持仓变化: -2, 成交价格: 0.0088, 正股代码: "510300" }], 成交金额sum: -0.0176, 持仓变化sum: -2 },
      { 沽购: "沽", 正股ShowName: "300ETF🍆", 到期月: 7, 行权价: 4500, 正股代码: "510300", 期权名称: "300ETF沽7月4500", list: [{ 期权名称: "300ETF沽7月4500", 成交时间: "14:28:57", 持仓变化: -1, 成交价格: 0.0301, 正股代码: "510300" }], 成交金额sum: -0.0301, 持仓变化sum: -1 },
      { 沽购: "沽", 正股ShowName: "300ETF🍆", 到期月: 6, 行权价: 4600, 正股代码: "510300", 期权名称: "300ETF沽6月4600", list: [{ 期权名称: "300ETF沽6月4600", 成交时间: "14:52:27", 持仓变化: -1, 成交价格: 0.0152, 正股代码: "510300" }], 成交金额sum: -0.0152, 持仓变化sum: -1 },
      { 沽购: "沽", 正股ShowName: "300ETF🍆", 到期月: 7, 行权价: 4600, 正股代码: "510300", 期权名称: "300ETF沽7月4600", list: [{ 期权名称: "300ETF沽7月4600", 成交时间: "14:28:11", 持仓变化: -1, 成交价格: 0.0482, 正股代码: "510300" }], 成交金额sum: -0.0482, 持仓变化sum: -1 },
      { 沽购: "沽", 正股ShowName: "300ETF🍆", 到期月: 6, 行权价: 4700, 正股代码: "510300", 期权名称: "300ETF沽6月4700", list: [{ 期权名称: "300ETF沽6月4700", 成交时间: "14:04:35", 持仓变化: -1, 成交价格: 0.0281, 正股代码: "510300" }], 成交金额sum: -0.0281, 持仓变化sum: -1 },
      {
        沽购: "沽",
        正股ShowName: "300ETF🍆",
        到期月: 6,
        行权价: 4800,
        正股代码: "510300",
        期权名称: "300ETF沽6月4800",
        list: [
          { 期权名称: "300ETF沽6月4800", 成交时间: "14:55:55", 持仓变化: -1, 成交价格: 0.0675, 正股代码: "510300" },
          { 期权名称: "300ETF沽6月4800", 成交时间: "14:03:26", 持仓变化: -1, 成交价格: 0.0554, 正股代码: "510300" },
        ],
        成交金额sum: -0.12290000000000001,
        持仓变化sum: -2,
      },
      { 沽购: "购", 正股ShowName: "300ETF🍆", 到期月: 7, 行权价: 5250, 正股代码: "510300", 期权名称: "300ETF购7月5250", list: [{ 期权名称: "300ETF购7月5250", 成交时间: "14:30:32", 持仓变化: 1, 成交价格: 0.0195, 正股代码: "510300" }], 成交金额sum: 0.0195, 持仓变化sum: 1 },
      {
        沽购: "沽",
        正股ShowName: "沪500🦁",
        到期月: 6,
        行权价: 7750,
        正股代码: "510500",
        期权名称: "500ETF沽6月7750",
        list: [
          { 期权名称: "500ETF沽6月7750", 成交时间: "10:19:58", 持仓变化: 2, 成交价格: 0.0225, 正股代码: "510500" },
          { 期权名称: "500ETF沽6月7750", 成交时间: "09:34:02", 持仓变化: 1, 成交价格: 0.0329, 正股代码: "510500" },
          { 期权名称: "500ETF沽6月7750", 成交时间: "09:32:03", 持仓变化: -1, 成交价格: 0.035, 正股代码: "510500" },
        ],
        成交金额sum: 0.042899999999999994,
        持仓变化sum: 2,
      },
      { 沽购: "购", 正股ShowName: "深500🐯", 到期月: 7, 行权价: 3600, 正股代码: "159922", 期权名称: "中证500ETF购7月3600", list: [{ 期权名称: "中证500ETF购7月3600", 成交时间: "14:17:45", 持仓变化: 1, 成交价格: 0.0301, 正股代码: "159922" }], 成交金额sum: 0.0301, 持仓变化sum: 1 },
    ],
  },
  {
    day: "2026-06-04",
    data: [
      {
        沽购: "购",
        正股ShowName: "50ETF🧊",
        到期月: 6,
        行权价: 3100,
        正股代码: "510050",
        期权名称: "50ETF购6月3100",
        list: [
          { 期权名称: "50ETF购6月3100", 成交时间: "13:30:50", 持仓变化: 2, 成交价格: 0.0075, 正股代码: "510050" },
          { 期权名称: "50ETF购6月3100", 成交时间: "11:19:30", 持仓变化: 1, 成交价格: 0.008, 正股代码: "510050" },
          { 期权名称: "50ETF购6月3100", 成交时间: "11:19:25", 持仓变化: 2, 成交价格: 0.008, 正股代码: "510050" },
          { 期权名称: "50ETF购6月3100", 成交时间: "11:19:22", 持仓变化: 1, 成交价格: 0.008, 正股代码: "510050" },
          { 期权名称: "50ETF购6月3100", 成交时间: "10:06:13", 持仓变化: 4, 成交价格: 0.0089, 正股代码: "510050" },
        ],
        成交金额sum: 0.0826,
        持仓变化sum: 10,
      },
      { 沽购: "购", 正股ShowName: "50ETF🧊", 到期月: 7, 行权价: 3100, 正股代码: "510050", 期权名称: "50ETF购7月3100", list: [{ 期权名称: "50ETF购7月3100", 成交时间: "10:52:19", 持仓变化: 1, 成交价格: 0.03, 正股代码: "510050" }], 成交金额sum: 0.03, 持仓变化sum: 1 },
      { 沽购: "购", 正股ShowName: "50ETF🧊", 到期月: 6, 行权价: 3200, 正股代码: "510050", 期权名称: "50ETF购6月3200", list: [{ 期权名称: "50ETF购6月3200", 成交时间: "11:14:05", 持仓变化: 4, 成交价格: 0.0028, 正股代码: "510050" }], 成交金额sum: 0.0112, 持仓变化sum: 4 },
      {
        沽购: "购",

        正股ShowName: "50ETF🧊",
        到期月: 7,
        行权价: 3200,
        正股代码: "510050",
        期权名称: "50ETF购7月3200",
        list: [
          { 期权名称: "50ETF购7月3200", 成交时间: "13:24:57", 持仓变化: 2, 成交价格: 0.013, 正股代码: "510050" },
          { 期权名称: "50ETF购7月3200", 成交时间: "09:30:00", 持仓变化: 4, 成交价格: 0.0145, 正股代码: "510050" },
        ],
        成交金额sum: 0.084,
        持仓变化sum: 6,
      },
      {
        沽购: "购",

        正股ShowName: "300ETF🍆",
        到期月: 6,
        行权价: 5250,
        正股代码: "510300",
        期权名称: "300ETF购6月5250",
        list: [
          { 期权名称: "300ETF购6月5250", 成交时间: "13:10:08", 持仓变化: 2, 成交价格: 0.007, 正股代码: "510300" },
          { 期权名称: "300ETF购6月5250", 成交时间: "13:10:01", 持仓变化: 3, 成交价格: 0.007, 正股代码: "510300" },
        ],
        成交金额sum: 0.035,
        持仓变化sum: 5,
      },
      {
        沽购: "购",

        正股ShowName: "300ETF🍆",
        到期月: 7,
        行权价: 5500,
        正股代码: "510300",
        期权名称: "300ETF购7月5500",
        list: [
          { 期权名称: "300ETF购7月5500", 成交时间: "13:31:02", 持仓变化: 1, 成交价格: 0.011, 正股代码: "510300" },
          { 期权名称: "300ETF购7月5500", 成交时间: "13:31:01", 持仓变化: 1, 成交价格: 0.011, 正股代码: "510300" },
        ],
        成交金额sum: 0.022,
        持仓变化sum: 2,
      },
      { 沽购: "购", 正股ShowName: "深500🐯", 到期月: 6, 行权价: 3600, 正股代码: "159922", 期权名称: "中证500ETF购6月3600", list: [{ 期权名称: "中证500ETF购6月3600", 成交时间: "13:09:05", 持仓变化: 1, 成交价格: 0.0101, 正股代码: "159922" }], 成交金额sum: 0.0101, 持仓变化sum: 1 },
      { 沽购: "购", 正股ShowName: "深500🐯", 到期月: 6, 行权价: 3700, 正股代码: "159922", 期权名称: "中证500ETF购6月3700", list: [{ 期权名称: "中证500ETF购6月3700", 成交时间: "13:42:34", 持仓变化: 2, 成交价格: 0.0045, 正股代码: "159922" }], 成交金额sum: 0.009, 持仓变化sum: 2 },
      { 沽购: "购", 正股ShowName: "科50🐸", 到期月: 7, 行权价: 2050, 正股代码: "588000", 期权名称: "科创50购7月2050", list: [{ 期权名称: "科创50购7月2050", 成交时间: "09:51:14", 持仓变化: -1, 成交价格: 0.037, 正股代码: "588000" }], 成交金额sum: -0.037, 持仓变化sum: -1 },
    ],
  },
];
</script>
