import _ from "lodash";
export const 金额 = {
  基础金额: 50000,
  入金金额: 50000,
  场内现金: 50,
  占用保证金: 1000,
  期转股金额: 5000,
  贷款: 10000,
  已提现金额: 33742, // 期转现，金额详见<期货期权激励>
};
export const 最大建议买入价 = 350;
export const fields_dict = {
  f2: "最新价",
  // f3: "涨跌幅",
  // f4: "涨跌额",
  // f5: "成交量",
  // f6: "成交额",
  // "f12": "C期权代码",
  // f13: "市场标识",
  f14: "期权名称",
  f18: "昨收",
  f31: "买一",
  f32: "卖一",
  f108: "持仓量",
  f161: "行权价",
  f163: "日增",
  f249: "隐波",
  f250: "溢价率",
  // "": '最小单位',
  // f298: "时间价值",
  // f299: "内在价值",
  f301: "到期日",
  f303: "杠杆",
  f325: "Delta",
  f326: "Gamma",
  f328: "Theta",
  f333: "正股",
  f334: "正股价格",
  // "f339": "P期权代码",
  // f340: "P期权名称",
  // "f341": "P最新价",
  // "f342": "P涨跌额",
  // "f343": "P涨跌幅",
  // "f344": "P成交量",
  // "f345": "P持仓量",
  // "f346": "P隐波",
  // "f347": "P溢价率",
};
export const stock_code_map = {
  510050: "上证50ETF",
  510300: "沪深300ETF",
  510500: "中证500ETF",
  159922: "(深)中证500", // 中文名无关，特殊处理了
  588000: "科创50ETF",
  159915: "创业板ETF",
};
export const stock_color_map = {
  510050: "#73c0de",
  510300: "#91cc75",
  510500: "#fac858",
  159922: "#fc8452",
  588000: "#9a60b4",
  159915: "#ea7ccc",
};
export const stock_show_name_map = {
  510050: "50ETF 🧊",
  510300: "300ETF 🍆",
  510500: "500ETF 🥟",
  159922: "(深)中证500🥟",
  588000: "科创50ETF 🥕",
  159915: "创业板 🦑",
};
export const stock_sort_map = {
  510050: 1,
  510300: 2,

  510500: 3,
  159922: 4,

  588000: 5,
  159915: 6,
};
export const stock_sorted_list = _.sortBy(
  Object.keys(stock_sort_map),
  (code) => stock_sort_map[code]
);
export const 行权价_range_map = {
  510050: [2800, 4000],
  510300: [4200, 6000],
  510500: [6000, 10000],
  588000: [1200, 2000],
  159922: [2700, 4000],
  159915: [2700, 4000],
};
export const deadline_list = [
  // "20250924",
  // "20251022",
  "20251126",
  "20251224",
  // "20260128",
  // "20260225",
  "20260325",
  "20260624",
];
export const deadline_color_list = ["#809b48", "#6a5286", "#40699d", "#9f413e"];
export const deadline_map = {
  "01": "1月🧳",
  "02": "2月🌂",
  "03": "3月🧵",
  "04": "4月🥁",
  "05": "5月💶",
  "06": "6月🎩",
  "07": "7月🦺",
  "08": "8月🧥",
  "09": "9月🖥️",
  10: "10月🧦",
  11: "11月🎤",
  12: "12月👑",
};
export const UNIT = 10000;
export const 盈亏曲线数据 = _.unionBy(
  _.reverse([
    ["20251118", 26298],
    ["20251117", 25889],
    ["20251114", 28638],
    ["20251113", 36581],
    ["20251112", 32030],
    ["20251110", 38904],
    ["20251107", 39619],
    ["20251106", 43055],
    ["20251105", 45133],
    ["20251103", 49306],
    ["20251031", 53562],
    ["20251030", 55999],
    ["20251029", 64566],
    ["20251028", 49847],
    ["20251027", 55480],
    ["20251024", 46065],
    ["20251023", 39995],
    ["20251021", 41164],
    ["20251020", 39923],
    ["20251017", 42950],
    ["20251016", 43906],
    ["20251015", 46943],
    ["20251014", 46176],
    ["20251013", 45554],
    ["20251010", 40322],
    ["20251009", 33513],
  ]),
  (el) => el[0]
).map(([name, value]) => ({
  name,
  value,
}));
