import _ from 'lodash'
export const 入金金额 = 50000;
export const 已提现金额 = 0;
export const 场内现金 = 1548 + 5550;
export const 保证金 = 0;
export const 基础金额 = 50000;
// 股票账户2万待转出、期转股2千待处理
export const fields_dict = {
  f2: "最新价",
  f3: "涨跌幅",
  f4: "涨跌额",
  f5: "成交量",
  f6: "成交额",
  // "f12": "C期权代码",
  f13: "市场标识",
  f14: "期权名称",
  f18: "昨收",
  f31: "买一",
  f32: "卖一",
  f108: "持仓量",
  f161: "行权价",
  f163: "日增",
  f249: "隐波",
  f250: "溢价率",
  // "": '最小单位',
  // f298: "时间价值",
  // f299: "内在价值",
  f301: "到期日",
  f303: "杠杆",
  f325: "Delta",
  f326: "Gamma",
  f328: "Theta",
  f333: "正股",
  f334: "正股价格",
  // "f339": "P期权代码",
  // f340: "P期权名称",
  // "f341": "P最新价",
  // "f342": "P涨跌额",
  // "f343": "P涨跌幅",
  // "f344": "P成交量",
  // "f345": "P持仓量",
  // "f346": "P隐波",
  // "f347": "P溢价率",
};
export const stock_code_map = {
  510050: "上证50ETF",
  510300: "沪深300ETF",
  510500: "中证500ETF",
  159922: "(深)中证500", // 中文名无关，特殊处理了
  588000: "科创50ETF",
  159915: "创业板ETF",
};
export const stock_color_map = {
  510050: "#73c0de",
  510300: "#91cc75",
  510500: "#fac858",
  159922: "#fc8452",
  588000: "#9a60b4",
  159915: "#ea7ccc",
};
export const stock_show_name_map = {
  510050: "50ETF 🧊",
  510300: "300ETF 🍆",
  510500: "500ETF 🥟",
  159922: "(深)中证500🥟",
  588000: "科创50ETF 🥕",
  159915: "创业板 🦑",
};
export const stock_sort_map = {
  510050: 1,
  510300: 2,

  510500: 3,
  159922: 4,

  588000: 5,
  159915: 6,
};
export const stock_sorted_list = _.sortBy(
  Object.keys(stock_sort_map),
  (code) => stock_sort_map[code]
);
export const 行权价_range_map = {
  510050: [2800, 3400],
  510300: [4000, 5000],
  510500: [5500, 8000],
  588000: [1000, 1600],
  159922: [2300, 3200],
  159915: [2500, 3400],
};
export const deadline_list = [
  // "20250924",
  "20251022",
  "20251126",
  "20251224",
  // "20260128",
  // "20260225",
  "20260325",
];
export const deadline_map = {
  "01": "1月🧳",
  "02": "2月🌂",
  "03": "3月🧵",
  "04": "4月🥁",
  "05": "5月💶",
  "06": "6月🎩",
  "07": "7月🦺",
  "08": "8月🧥",
  "09": "9月🖥️",
  10: "10月🧦",
  11: "11月🎤",
  12: "12月👑",
};
export const UNIT = 10000;
