import _ from "lodash";
import { getValidExerciseDate } from "~/utils/date";
import dayjs from "dayjs";

const 最低本金贷款 = 1000; // 不消除这个贷款金了，所以接下来就留出1000用来投资，其他都提现
const 前一日贷款 = 最低本金贷款 + 39000; // 保持最低1000元贷款，还款提现部分存入出金字段
const 当日贷款 = 0;
export const 金额 = {
  第一目标: 5 * 10000,
  第二目标: 10 * 10000,
  第三目标: 20 * 10000,
  第四目标: 50 * 10000,

  // 初始入金，盈亏计算要减去它，如果现金0，贷款0，出金0，则为亏损1万
  基础金额: 10000,
  //
  场内现金: 398,
  占用保证金: 0, // 单笔保证金50 -> 15 了
  贷款: 前一日贷款 + 当日贷款,
  出金: 0, // 转出后不可转入，转入是贷款
  //
  //
  //
  // 👇不参与计算👇
  现转股票: 0,
  国泰期货入金_股指认购: 0,
  银河期货入金_股指认沽: 5000,

  华泰期货入金_期货期权: 0,
  POLYMARKET: 686,
};
export const 建议买入价 = 380;
export const 最大建议买入时间价 = 750;
export const 最大建议买入价 = 3000;

export const fields_dict = {
  f2: "最新价", // 0.0033
  // f3: "涨跌幅", // 10.0
  // f4: "涨跌额", // 0.0003
  // f5: "成交量", // 32268
  // f6: "成交额", // 1084940.7
  // "f12": "期权代码", // 1009623
  // f13: "市场标识", //10
  f14: "期权名称", // XD50ETF购12月3117A
  f18: "昨收", // 0.0031
  f31: "买一", // 0.0031
  f32: "卖一", // 0.0033
  f108: "持仓量", // 145300
  f161: "行权价", // 3.117
  f163: "日增量", // -4312
  f249: "隐波", // 15.53
  f250: "溢价率", // 3.15
  // "": '最小单位',
  // f298: "时间价值", // 0.0033
  // f299: "内在价值", // 0.0
  f301: "到期日", // 20251224
  f303: "杠杆", // 60.41
  f325: "Delta", // 0.0659
  f326: "Gamma", // 2.1658 正股变动0.01,Delta变动Gamma（正股变动1000元 , Delta 变动 Gamma*10）
  f327: "Vega", // 0.5226 隐波上涨1%,期权上涨52.26(隐波上涨1%，价格变动Vega * 100)
  f328: "Theta", // 0.0043
  f333: "正股", // XD上证50ETF
  f334: "正股价格", // 3.025
};

export const stock_index_fields_dict = {
  f2: "最新价",
  f3: "涨跌率",
  f4: "涨跌额",
  f5: "成交量",
  // # "f6": "成交额",
  // # "f12": "C期权代码",
  f13: "市场标识",
  f14: "期权名称",
  // # "f18": "昨收",
  f31: "买一",
  f32: "卖一",
  f108: "持仓量",
  f161: "行权价",
  // # "f163": "日增量",
  f249: "隐波",
  // # "f250": "溢价率",
  // # "": '最小单位',
  // # "f298": "时间价值",
  // # "f299": "内在价值",
  // # "f301": "到期日",
  // # "f303": "杠杆",
  f325: "Delta",
  // # "f326": "Gamma",
  // # "f328": "Theta",
  f333: "正股",
  f334: "正股价格",
  // # "f339": "P期权代码",
  // # "f340": "P期权名称",
  // # "f341": "P最新价",
  // # "f342": "P涨跌额",
  // # "f343": "P涨跌幅",
  // # "f344": "P成交量",
  // # "f345": "P持仓量",
  // # "f346": "P隐波",
  // # "f347": "P溢价率",
};
export const OPTIONS_MAP = [
  {
    code: "510050",
    name: "50ETF",
    linkName: ["上证50ETF", "XD上证50ETF"], // 链接stock_code
    color: "#73c0de",
    showName: "上_50🧊", // 顶部tab筛选会用到
    极简Name: "🧊",
    隐波Max: 15,
    fs: "m:10+c:510050",
  },
  {
    code: "510300",
    name: "300ETF",
    linkName: ["沪深300ETF华泰柏瑞", "XD沪深300ETF华泰柏瑞"],
    color: "#91cc75",
    showName: "沪300🍆",
    极简Name: "🍆",
    隐波Max: 15,
    fs: "m:10+c:510300",
  },
  {
    code: "510500",
    name: "沪500ETF",
    linkName: ["中证500ETF"],
    color: "#fac858",
    showName: "沪500🦁",
    极简Name: "🦁",
    隐波Max: 22,
    fs: "m:10+c:510500",
  },
  {
    code: "159922",
    name: "深500ETF", // 中文名无关，特殊处理了
    linkName: ["深500"], // 中文名无关，特殊处理了
    color: "#fc8452",
    showName: "深500🐯",
    极简Name: "🐯",
    隐波Max: 22,
    fs: "m:12+c:159922",
  },
  {
    code: "159915",
    name: "创业板ETF",
    linkName: ["创业板ETF易方达"],
    color: "#ea7ccc",
    showName: "创ETF🦑",
    极简Name: "🦑",
    隐波Max: 22,
    fs: "m:12+c:159915",
  },
  {
    code: "588000",
    name: "科50ETF",
    linkName: ["科创50ETF"],
    color: "#9a60b4",
    showName: "科_50🐸",
    极简Name: "🐸",
    隐波Max: 22,
    fs: "m:10+c:588000",
  },
];
export const STOCK_INDEX_OPTIONS_MAP = [
  {
    code: "上证50",
  },
  {
    code: "沪深300",
  },
  {
    code: "中证1000",
  },
];
const 股指持仓List = [
  // 购购购购购购购购购购购购购购购购购购购购购购购
  // 300
  // ["沪深300购26年7月4900", 1, 1380],
  // 50
  // ["上证50购26年7月3000", 1, 1180],
  // 1000
  // ["中证1000购26年7月8600", 1, 1560],
  // 沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽沽
  // 300
  // 50
  // 1000
];
export const 股指持仓JSON = 股指持仓List.map((el) => ({
  期权名称: el[0],
  持仓: el[1],
  成本: el[2],
}));
export const STOCK_INDEX_DAY_MAP = {
  // 2607: "2026-07-17",
  // 2608: "2026-08-21",
  2609: "2026-09-18",
  2610: "2026-10-16",
  2611: "2026-11-20",
  2612: "2026-12-18",
  2703: "2027-03-19",
  2706: "2027-06-18",
};
export const STOCK_INDEX_MONTH_LIST = Object.keys(STOCK_INDEX_DAY_MAP);

export const deadline_list = getValidExerciseDate(dayjs().format("YYYY-MM-DD"));
export const deadline_color_list = ["#809b48", "#6a5286", "#40699d", "#9f413e"];
export const deadline_map = {
  "01": "1月🧳",
  "02": "2月🌂",
  "03": "3月🧵",
  "04": "4月🥁",
  "05": "5月💶",
  "06": "6月🎩",
  "07": "7月🦺",
  "08": "8月🧥",
  "09": "9月🖥️",
  10: "10月🧦",
  11: "11月🎤",
  12: "12月👑",
};
export const MONTH_ICON = {
  "01月": "🧳",
  "02月": "🌂",
  "03月": "🧵",
  "04月": "🥁",
  "05月": "💶",
  "06月": "🎩",
  "07月": "🦺",
  "08月": "🧥",
  "09月": "🖥️",
  "10月": "🧦",
  "11月": "🎤",
  "12月": "👑",
};
